#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fabric_workspace.example1 will be created
  + resource "fabric_workspace" "example1" {
      + capacity_assignment_progress = (known after apply)
      + capacity_region              = (known after apply)
      + description                  = "Example Workspace 1"
      + display_name                 = "example1"
      + id                           = (known after apply)
      + onelake_endpoints            = (known after apply)
      + type                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @ehsaneskandariboc, Action: `pull_request`*